
/*
Задача написать программу, которая получает в качестве
аргументов командной строки два числа и слово-строку.
Числа указывают программе начальный символ и кол-во
символов подстроки, которое программа должна вывести
на экран. Пример
% java Substring hello 1 3 вывод: ell

Программа должна обрабатывать все исключения, обусловленные
неправильным вводом.
Задача взята из книги Дэвида Флегана Java in a nutshell examples.
Author Mikhail Fedorenko.
*/

public class Task1_3{
	public static void main(String[] args){
		
	}
}